<?php
/*Взять любую предметную область (Авиабилеты, кинотеатры, афиши, рестораны, логистика или другое). Продумать какая может быть функциональность в приложении самая основная. Продумать какие могут быть сущности и чем они характеризуются. Спроектировать и нарисовать UML диаграмму классов и интерфейсов для выбранной предметной области. Как пример (Система для тур. Агентства. Ключевые сущности: пользователь, тур, страны и города. Продумать систему которая позволит хранить данные для всех необходимых сущностей, обрабатывать их корректно. Ключевые возможности: выбор тура из списка туров, оплата тура, выбор страны и города для тура и т.д.)*/

//Кинотеатр
// Классы homework_2_5_class.jpg
// База данных homework_2_5_db.jpg
/*
Пользователь:
    - личный кабинет с данными
    - Имя
    - Фамилия
    - Email
    - Телефон
    - История заказов
Каталог фильмов:
    - фильтр по параметрам, жанрам, дате сеансов
Фильм:
    - Название
    - Описание
    - Расписание
    - Кнопка "Купить билет"
Заказ:
    - Выбор даты
    - места
    - фома оплаты
*/
